[
{
  "name": "Vegan Tikka Masala Curry with Eggplant, Red Kidney Beans and Zucchini/Courgette",
  "cookTime": "PT30M",
  "prepTime": "PT15M",
  "cookingMethod": "",
  "nutritionInformation": {},
  "recipeCategory": "Main dish",
  "recipeCuisine": "British Indian",
  "ingredients": [
    {
      "name": "2 medium [300g] Chinese eggplants",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 tablespoon salt",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "Water for soaking",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 small [180g] courgette/zucchini",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 tablespoon minced ginger (or ginger-garlic paste)",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 small onion, sliced or chopped",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1¼ cup [300ml] tomato puree (canned or fresh, blended)",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 cup [170g] cooked/boiled red kidney beans",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "½ can [200ml] coconut milk",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "2 tablespoons tikka masala mix (store-bought or use our homemade recipe)",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "Pinch of chilli powder to taste",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "2 tablespoons vegetable or coconut oil",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "Salt to taste",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 teaspoon maple syrup (or sugar), optional or adjust to taste",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "¼ cup chopped coriander leaves (cilantro) for garnish",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    }
  ],
  "instructions": [
    "Wash and cut the Chinese eggplants across about 2.5 cm or 1-inch thick. Place in a bowl and sprinkle with 1 tablespoon salt. Massage the salt into the eggplants, and then fill the bowl with water to cover them. Leave aside to soak for 10-12 minutes.",
    "Meanwhile, prepare the other vegetables. Slice the courgette into half-moons of about 1 cm thick.",
    "Slice or chop the onion.",
    "When ready, drain the eggplants and rinse a couple of times with fresh water to remove the excess salt. Pat them dry with a paper towel.",
    "In a skillet, over medium heat, add 2 tablespoons vegetable or coconut oil. Add in the eggplant. Fry for about 7 minutes on one side or until golden. Then flip and fry for another 7 minutes on the other side. Prick the eggplant with a fork to test for doneness. If the fork goes it smoothly with no spongy resistance, the eggplants are done. Remove from the pan and set aside.",
    "In the same pan, on medium-high heat, add the onions and minced ginger (or ginger-garlic paste). Cook for about 1 minute or until the onions are a little translucent.",
    "Add the tikka masala mix and roast for about 10 seconds.",
    "Add the tomato puree, stir and mix well with the spices. Simmer for about 10 minutes or until tomato puree slightly changes colour.",
    "Add in the cooked red kidney beans followed by the courgette. Cover and simmer for about 7 minutes.",
    "Add the eggplant.",
    "Add the coconut milk and mix well. Take care not to crush the eggplant as they are quite delicate at this stage.",
    "Add salt to taste. Taste the sauce, then add the maple syrup or sugar (if needed). This will depend on how sour or sweet the tomatoes are.",
    "Cover and simmer for about 5 minutes. Turn off the heat. Garnish with coriander leaves (cilantro) and serve over rice or with roti/naan bread."
  ]
},
{
  "name": "Brown Chickpea and Eggplant Veggie Burger",
  "cookTime": "PT30M",
  "prepTime": "PT25M",
  "cookingMethod": "",
  "nutritionInformation": {},
  "recipeCategory": "Main Dish",
  "recipeCuisine": "Fusion",
  "ingredients": [
    {
      "name": "2 cups dried brown/black chickpeas (yield 4 and a half cup cooked)",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 medium [700g, 25oz] eggplant",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 tablespoon soy sauce (use Tamari for gluten-free or use a little salt or check the blog for a soyfree gluten-free soy sauce substitute)",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 cup chopped coriander (cilantro) leaves",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "Â¼ cup water from the cooked chickpeas",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "Â¾ cup water",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 cup rolled oats (use gluten-free certified if required)",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "2 green chilies",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 teaspoon paprika",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 teaspoon cumin",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 tablespoon minced ginger",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "2 tablespoons tomato puree",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 tablespoon maple syrup",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 tablespoon lemon juice",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "10 - 12 curry leaves",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "Salt and pepper to taste",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "Â¾ cup [90g] Buckwheat flour or as needed for coating (you may substitute with rice flour, other gluten-free flour or regular all-purpose flour will work too if you do not need this to be gluten-free)",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "Oil for frying",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    }
  ],
  "instructions": [
    "Soak the chickpeas overnight or for at least 8 hours. Then drain all the water and rinse. Place chickpeas in a deep pan and cover with water. Bring to a boil then reduce heat to medium and simmer for about 30-40 minutes or until chickpeas are soft and easy to mash. Once cooked, drain all the chickpeas but keep the water. Reduce the chickpea water to Â¼ cup and allow to cool. If using canned beans, use Â¼ cup of liquid from the can of beans.",
    "Mash the chickpeas with a fork or use a food processor. But take care not to turn them into a paste. They should just be pulsed. Reserve about Â½ cup to add to the blender mix.",
    "When chickpeas are cooking, you can also cook the aubergine in another pan. Wash and cut them into strips. Place in a non-stick pan with 1 tablespoon soy sauce and 1-2 tablespoons water. Stir and mix, then cover and let cook on medium heat. Occasionally check on the aubergine and give it a stir or add a little water if required. Once aubergine is soft and mushy, remove from heat and place in a large plate. Mash them with a fork to form a puree or pulse them in a food processor. If using a fork, you may remove the skin from the puree as they may later cause the burgers to break if they are too large.",
    "In a blender, place the coriander leaves, chilies, paprika, cumin, minced ginger, tomato puree, maple syrup, lemon juice, curry leaves, 1 cup oats, Â½ cup brown chickpeas, Â¼ cup chickpea water and Â¾ cup water. Blend until smooth.",
    "In a large mixing bowl, add the mashed chickpeas, add the eggplant puree. Mix well.",
    "Next add in the mixture from the blender and mix well. You may taste the mixture at this point to adjust the salt. Add pepper to your taste if desired.",
    "Now let this mixture sit on the counter for 15 minutes. You can use this time to clean up a little bit and do the washing up!",
    "After 15 minutes, take a Â½ cup measurement and scoop out the mixture.",
    "Preheat the oven at 350 degrees Fahrenheit (180 degrees Celsius).",
    "Place a scoop of the mixture into the palm of one hand and shape lightly into a ball, then flatten lightly. Place onto a baking tray lined with parchment paper. You may shape or flatten the patties further on the tray. The burgers will become just slightly smaller after baking and cooling.",
    "Bake for 15 minutes on one side. Then turn the burgers onto the other side and bake for another 10 minutes. Remove from the oven and let cool slightly before serving.",
    "Get a bowl with about Â¾ cup of buckwheat flour. Form a ball in your hands then dip it into the flour to coat it. If you are not frying it immediately, place it on a plate and repeat for the rest of the mixture. Just before frying, flatten the balls and shape into patties. Dip into more flour if needed.",
    "Heat a skillet on medium-high. The oil needs to be hot. Place the patties into the skillet. I like to fry only 2 at a time so that I can turn them over easily. Once the burger has a crispy shell on one side, turn onto the other side. You may flatten it a little further with a spatula at this stage. Allow to cook until the other side is crispy. It will take about 12 - 15 minutes for the burgers to be cooked. Remove from the oil and drain on some absorbent paper. Allow to cool a little before serving."
  ]
},
{
  "name": "Chicken Pot Pie IX",
  "cookTime": "PT50M",
  "prepTime": "PT20M",
  "cookingMethod": "",
  "nutritionInformation": {},
  "recipeCategory": "",
  "recipeCuisine": "",
  "ingredients": [
    {
      "name": "1 pound skinless, boneless chicken breast halves - cubed",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 cup sliced carrots",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 cup frozen green peas",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/2 cup sliced celery",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/3 cup butter",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/3 cup chopped onion",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/3 cup all-purpose flour",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/2 teaspoon salt",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/4 teaspoon black pepper",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/4 teaspoon celery seed",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 3/4 cups chicken broth",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "2/3 cup milk",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "2 (9 inch) unbaked pie crusts",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    }
  ],
  "instructions": [
    "Preheat oven to 425 degrees F (220 degrees C.) In a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside. In the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside. Place the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape. Bake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving."
  ]
},
{
  "name": "Meatball Nirvana",
  "cookTime": "PT20M",
  "prepTime": "PT20M",
  "cookingMethod": "",
  "nutritionInformation": {},
  "recipeCategory": "",
  "recipeCuisine": "",
  "ingredients": [
    {
      "name": "1 pound extra lean ground beef",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/2 teaspoon sea salt",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 small onion, diced",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/2 teaspoon garlic salt",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 1/2 teaspoons Italian seasoning",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "3/4 teaspoon dried oregano",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "3/4 teaspoon crushed red pepper flakes",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 dash hot pepper sauce (such as Frank's RedHotÂ®), or to taste",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1 1/2 tablespoons Worcestershire sauce",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/3 cup skim milk",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/4 cup grated Parmesan cheese",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    },
    {
      "name": "1/2 cup seasoned bread crumbs",
      "amount": {
        "measurement": 0,
        "unitOfMeasure": ""
      }
    }
  ],
  "instructions": [
    "Preheat an oven to 400 degrees F (200 degrees C). Place the beef into a mixing bowl, and season with salt, onion, garlic salt, Italian seasoning, oregano, red pepper flakes, hot pepper sauce, and Worcestershire sauce; mix well. Add the milk, Parmesan cheese, and bread crumbs. Mix until evenly blended, then form into 1 1/2-inch meatballs, and place onto a baking sheet. Bake in the preheated oven until no longer pink in the center, 20 to 25 minutes."
  ]
}]